IDEA StatiCa Open Model
PointOnLine3D.Position Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the position value on the line.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double Position { get; set; }
Public Property Position As Double
	Get
	Set
public:
property double Position {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
PointOnLine3D Class
IdeaRS.OpenModel.Geometry3D Namespace